app/Controllers/Mahasiswa.php

    public function index()
    {

        $currentPage = $this->request->getvar('page_mahasiswa') ? $this->request->getVar('page_mahasiswa') : 1;


        // Ambil Data :
        // dd($this->request->getVar('keyword'));
        $keyword = $this->request->getVar('keyword');
        if($keyword) {
            $mahasiswa = $this->mahasiswaModel->search($keyword);
        } else {
            $mahasiswa = $this->mahasiswaModel;
        }


        $data = [
            'title' => 'Comic Page',
            'mahasiswa' => $mahasiswa->paginate(3, 'mahasiswa'),
            'pager' => $this->mahasiswaModel->pager,
            'currentPage' => $currentPage
        ];
---
SELECT *
FROM `mahasiswa`
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `mahasiswa`
SELECT *
FROM `mahasiswa`
 LIMIT 3