app/Models/KomikModel.php

    public function getKomik($slug = false)
    {
        if ($slug == false) {
            return $this->findAll();
        }

        // Tidak perlu pakai else, karena klo else langsung keluar
        return $this-> where(['slug' => $slug])->first();
---
SELECT *
FROM `komik`
SELECT *
FROM `komik`
WHERE `slug` = 'judul-e'
 LIMIT 1